pages/Page1/queries/Api1/Api1.txt

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ipor="http://www.iportalmais.pt">
   <soapenv:Header/>
   <soapenv:Body>
      <ipor:userAuthentication soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <username xsi:type="xsd:string">{{input1.text}}</username>
         <password xsi:type="xsd:string">{{input2.text}}</password>
      </ipor:userAuthentication>
   </soapenv:Body>
</soapenv:Envelope>